/*
 * Deal.h
 *
 *  Created on: 2021年12月30日
 *      Author: 11609
 */

#ifndef CODE_DEAL_H_
#define CODE_DEAL_H_
#ifndef _DEAL_H
#define _DEAL_H //图像处理，提取中线
#include "headfile.h"
#define white 1
#define black 0

#define GET_V_LEFT()    adc_mean_filter(ADC_0,ADC0_CH4_A4,ADC_12BIT,3); //
#define GET_LEFT()      adc_mean_filter(ADC_0,ADC0_CH2_A2,ADC_12BIT,3); //adc_mean_filter(ADC_0,ADC0_CH2_A2,ADC_12BIT,3);
#define GET_MID()       adc_mean_filter(ADC_0,ADC0_CH3_A3,ADC_12BIT,3);  //
#define GET_RIGHT()     adc_mean_filter(ADC_0,ADC0_CH0_A0,ADC_12BIT,3); //
#define GET_V_RIGHT()   adc_mean_filter(ADC_0,ADC0_CH1_A1,ADC_12BIT,3);  //

/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:09
 ********************************************************/
float Get_midline();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Get_Elec_err();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void _8_Init_Heading_Dir();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
uint8 Get_VerticalHeight(uint8 x0, uint8 y0);
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
float GetSlope(uint8 x1, uint8 y1, uint8 x2, uint8 y2);
float GetSlope2(uint8 x1, uint8 y1, uint8 x2, uint8 y2);
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
float Basic_Least_Square(uint8 *a, uint8 length); //最小二乘法
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Vertical_scanning();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Fill_line(int8 L_x, int8 L_y, uint8 R_x, uint8 R_y);
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void ImageInit();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void FitRoad(void);
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Fill_line_image(int8 L_x, int8 L_y, uint8 R_x, uint8 R_y);
void Fill_line_set(int8 L_x, int8 L_y, uint8 R_x, uint8 R_y, uint8 set_y);
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Deal_firstline();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Ladder();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Get_eight_neighbour();
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void smooth(); //赛道平滑处理
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:14:32
 ********************************************************/
void Judge_Cross(); //十字处理
/********************************************************
 *@函数名:
 *@说明: none
 *@函数功能: none
 *@Date: 2022-06-25 00:20:36
 ********************************************************/
void Fork_Image();
void Fit_Top_edge_Y();
extern char *state_name;
extern uint8 G_point[2][4];
extern uint8 flag_xxx;
extern uint8 test_G[2][4];
extern uint8 is_checkRing, is_checkPoDao, is_checkZebro, is_useDianCi, is_ChuKu;
extern uint8 Top_edge_Y[94];
#endif

#endif /* CODE_DEAL_H_ */
